# Assignment on Store_sales dataset

**Load the Dataset**

In [6]:
import pandas as pd
store_sales=pd.read_csv("store_sales.csv")
store_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   store_id  100 non-null    object
 1   city      100 non-null    object
 2   Jan       100 non-null    int64
 3   Feb       100 non-null    int64
 4   Mar       100 non-null    int64
 5   Apr       100 non-null    int64
 6   May       100 non-null    int64
 7   Jun       100 non-null    int64
 8   July      100 non-null    int64
 9   Aug       100 non-null    int64
 10  Sep       100 non-null    int64
 11  Oct       100 non-null    int64
 12  Nov       100 non-null    int64
 13  Dec       100 non-null    int64
dtypes: int64(12), object(2)
memory usage: 11.1+ KB

**Calculate the total sales for each store across all months.**

In [10]:
store_sales["total_sales"]=store_sales.iloc[:,2:14].sum(axis=1)
store_sales[['store_id','total_sales']]

   store_id  total_sales
0       S_1          178
1       S_2          174
2       S_3          181
3       S_4          135
4       S_5          159
..      ...          ...
95     S_96          185
96     S_97          154
97     S_98          168
98     S_99          173
99    S_100          180

[100 rows x 2 columns]

**Find the average sales for each month across all stores**

In [30]:
months=store_sales.iloc[:,2:14]
b=months.mean()
b

Jan     14.46
Feb     15.09
Mar     14.56
Apr     14.57
May     13.56
Jun     13.80
July    14.38
Aug     15.81
Sep     14.91
Oct     14.10
Nov     15.31
Dec     13.57
dtype: float64

**Identify the store with the highest total sales.**

In [20]:
store_sales_max=store_sales[store_sales['total_sales']==store_sales['total_sales'].max()]
store_sales_max

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec,total_sales,total_sales_columns
61,S_62,California,16,21,6,22,22,9,21,21,22,17,16,21,214,NaN
85,S_86,California,15,23,24,18,21,17,23,13,12,11,24,13,214,NaN

**Calculate the total sales for each city.**

In [46]:
a=store_sales.groupby("city").sum()
a['total_sales']

city
Arizona       3951
California    7522
Texas         5939
Name: total_sales, dtype: int64

**List stores with total sales greater than 200**

In [47]:
b=store_sales[store_sales['total_sales']>20]
b[['total_sales', 'store_id']]

    total_sales store_id
0           178      S_1
1           174      S_2
2           181      S_3
3           135      S_4
4           159      S_5
..          ...      ...
95          185     S_96
96          154     S_97
97          168     S_98
98          173     S_99
99          180    S_100

[100 rows x 2 columns]

**Which month had the highest average sales across all stores?**

In [42]:
months=store_sales.iloc[:,2:14]
c=months.mean()
print(c)
c.idxmax()

Jan     14.46
Feb     15.09
Mar     14.56
Apr     14.57
May     13.56
Jun     13.80
July    14.38
Aug     15.81
Sep     14.91
Oct     14.10
Nov     15.31
Dec     13.57
dtype: float64

'Aug'

In [43]:
print(c)
print(c.idxmin())

Jan     14.46
Feb     15.09
Mar     14.56
Apr     14.57
May     13.56
Jun     13.80
July    14.38
Aug     15.81
Sep     14.91
Oct     14.10
Nov     15.31
Dec     13.57
dtype: float64
May

**Which city generated the most revenue?**

e=store_sales.groupby("city").sum()
e.idxmax()

In [59]:
e=store_sales.groupby("city").sum()
e['total_sales'].idxmax()

'California'